marcolo-30/Proyecto2_RTOS/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_S5_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_S5_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_S5_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_S5_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_S5_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_S5_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTC10 (number 86), J1[13]/I2S_RX_FS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_S4_FGPIO FGPIOC              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_S4_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_S4_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_S4_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_S4_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_S4_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTC11 (number 87), J1[15]/I2S_RXD
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_S3_FGPIO FGPIOC              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_S3_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_S3_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_S3_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_S3_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_S3_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTE2 (number 3), J3[15]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_E8_FGPIO FGPIOE             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_E8_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_E8_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_E8_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_E8_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_E8_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTE3 (number 4), J3[13]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_E7_FGPIO FGPIOE             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_E7_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_E7_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_E7_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_E7_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_E7_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTE6 (number 7), J3[11]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_E6_FGPIO FGPIOE             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_E6_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_E6_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_E6_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_E6_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_E6_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTE16 (number 14), J3[9]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_E5_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_E5_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_E5_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_E5_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_E5_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_E5_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTE17 (number 15), J3[7]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_E4_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_E4_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_E4_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_E4_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_E4_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_E4_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTE18 (number 16), J3[5]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_E3_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_E3_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_E3_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_E3_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_E3_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_E3_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTE19 (number 17), J3[3]
  @{ */

