marcolo-30/Proyecto2_RTOS/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_E2_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_E2_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_E2_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_E2_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_E2_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_E2_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTE31 (number 28), J3[1]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_E1_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_E1_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_E1_GPIO_PIN_MASK (1U << 31U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_E1_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_E1_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_E1_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTE0 (number 1), J2[18]/D14
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_TX_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_TX_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_TX_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTE1 (number 2), J2[20]/D15
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RX_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RX_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RX_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTC8 (number 84), J1[14]/D6
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_column3_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_column3_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_column3_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_column3_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_column3_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_column3_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTA6 (number 40), J2[7]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RW_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_RW_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RW_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RW_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RW_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RW_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTA14 (number 44), J2[9]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RS_FGPIO FGPIOA              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_RS_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RS_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RS_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RS_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RS_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTA1 (number 35), J1[2]/D0/UART1_RX_TGTMCU
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_row1_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_row1_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_row1_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_row1_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_row1_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_row1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTE29 (number 26), LED_RED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_RED_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_LED_RED_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_RED_GPIO_PIN_MASK (1U << 29U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LED_RED_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED_RED_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_RED_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
